Revit 2023 API
MassEnergyAnalyticalModel Class
 This class associates a mass instance with an energy analytical model data and geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' class instead.")]
public class MassEnergyAnalyticalModel : Element
Visual Basic
<ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' class instead.")> _
Public Class MassEnergyAnalyticalModel _
	Inherits Element
Visual C++
[ObsoleteAttribute(L"This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' class instead.")]
public ref class MassEnergyAnalyticalModel : public Element
Remarks
 The geometry begins as a copy of its associated mass instance geometry and is modified according to the requirements of the energy analytical model. MassZones are created from the MassEnergyAnalyticalModel and MassLevelDatas associated with a common mass instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel
See Also
MassEnergyAnalyticalModel Members
Autodesk.Revit.DB.Analysis Namespace